upstream/OpenFOAM-v2606/tutorials/heatTransfer/chtMultiRegionTwoPhaseEulerFoam/solidQuenching2D/0.orig/water/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    maxY
    {
        type            prghTotalPressure;
        value           $internalField;
        p               $internalField;
        p0              $internalField;
        U               U.gas;
    }

    maxX
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    minY
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    water_to_solid
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
